Revit 2024 API
BuiltInFailures.GeneralFailures.NameIsEmpty Property
 Name is empty
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NameIsEmpty { get; }
Visual Basic
Public Shared ReadOnly Property NameIsEmpty As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NameIsEmpty {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace